repository/app/controllers/dids_controller.rb

SELECT  "dids".* FROM "dids" WHERE "dids"."did" = ? LIMIT ?  [["did", "zQmYNqkGmB89TapZfc9WPQjfVbLNWBCrMXh5K8UdhzPWrs6"], ["LIMIT", 1]]
---
    def create
        # input
        input = params.except(:controller, :action)
        did = input["did"]
        didDocument = input["did-document"]
        logs = input["logs"]

        # validate input
        if did.nil? || did == {}
            render json: {"error": "missing DID"},
                   status: 400
            return
        end
        if did[0,8] != "did:oyd:"
            render json: {"error": "invalid DID"},
                   stauts: 412
            return
        end
        didLocation = did.split(LOCATION_PREFIX)[1] rescue ""
        didHash = did.split(LOCATION_PREFIX)[0] rescue did
        didHash = didHash.delete_prefix("did:oyd:")
        if !Did.find_by_did(didHash).nil?

INSERT INTO "dids" ("did", "doc", "created_at", "updated_at") VALUES (?, ?, ?, ?)
INSERT INTO "logs" ("item", "oyd_hash", "did", "ts", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)
---
            return
        end

        Did.new(did: didHash, doc: didDocument.to_json).save
        logs.each do |item|
            if item["op"] == 1 # REVOKE
                Log.new(did: didHash, item: item.to_json, oyd_hash: oyd_hash(item.except("previous").to_json), ts: Time.now.to_i).save

SELECT  "dids".* FROM "dids" WHERE "dids"."did" = ? LIMIT ?  [["did", "zQmd2HAA6QPnLrcFKoUmqZgCAqdb8aBFbpA81yHpuoVDqz5"], ["LIMIT", 1]]
DELETE FROM "dids" WHERE "dids"."id" = ?  [["id", 3]]
DELETE FROM "logs" WHERE "logs"."id" = ?  [["id", 5]]
SELECT "logs".* FROM "logs" WHERE "logs"."did" = ?  [["did", "zQmd2HAA6QPnLrcFKoUmqZgCAqdb8aBFbpA81yHpuoVDqz5"]]
---
    def delete
        @did = Did.find_by_did(params[:did].to_s)
        if @did.nil?
            render json: {"error": "DID not found"},
                   status: 404
            return
        end
        keys = JSON.parse(@did.doc)["key"]
        public_doc_key = keys.split(":")[0]
        public_rev_key = keys.split(":")[1]
        private_doc_key = Ed25519::SigningKey.new(oyd_decode(params[:dockey]))
        private_rev_key = Ed25519::SigningKey.new(oyd_decode(params[:revkey]))
        if public_doc_key == oyd_encode(private_doc_key.verify_key.to_bytes) &&
           public_rev_key == oyd_encode(private_rev_key.verify_key.to_bytes)
                Log.where(did: params[:did].to_s).destroy_all