repository/app/controllers/logs_controller.rb

SELECT  "logs".* FROM "logs" WHERE "logs"."oyd_hash" = ? LIMIT ?  [["oyd_hash", "zQmWkDUAQzoF72WqyYdo4wujZEoof2rH9T76sANChoB1RJB"], ["LIMIT", 1]]
SELECT "logs"."item" FROM "logs" WHERE "logs"."did" IN (?, ?)  [["did", "zQmZ7NWSeWPPiceCGHCui7f7unZ1GsDHfjXh8xWBXrn3U4w"], ["did", "zQmVj6jp6DrbS58y5sXZ3Bhsgea2uRCt3BdJ1erQpFy5Gse"]]
---
    def show
        id = params[:id]
        location = id.split(LOCATION_PREFIX)[1] rescue ""
        id = id.split(LOCATION_PREFIX)[0] rescue id
        id = id.delete_prefix("did:oyd:")

        @log = Log.find_by_oyd_hash(id)
        if @log.nil?
            didHash = id
        else
            didHash = @log.did
        end
        logs = Log.where(did: didHash).pluck(:item).map { |i| JSON.parse(i) } rescue []